

export class CitiesService {
  getAllCities(): string[] {
    return [
      "Абакан", "Азов", "Александров", "Анапа", "Арзамас", "Армавир", "Архангельск",
      "Астрахань", "Ачинск", "Балашиха", "Барнаул", "Белгород", "Белогорск", "Бийск", "Благовещенск",
      "Брянск", "Великие Луки", "Великий Новгород", "Владивосток", "Владикавказ", "Владимир", "Волгоград", "Волжск",
      "Вологда", "Воркута", "Воронеж", "Воскресенск", "Выборг", "Вязьма", "Геленджик", "Горно-Алтайск",
      "Грозный", "Гусь-Хрустальный", "Дзержинск", "Дмитров", "Долгопрудный", "Домодедово", "Дубна", "Евпатория",
      "Екатеринбург", "Ессентуки", "Жигулевск", "Зеленогорск", "Иваново", "Ижевск", "Иркутск", "Йошкар-Ола",
      "Казань", "Калининград", "Калуга", "Каспийск", "Кемерово", "Керчь", "Киров", "Кисловодск",
      "Клин", "Клинцы", "Коломна", "Комсомольск-на-Амуре", "Королев", "Кострома", "Котлас", "Красногорск",
      "Краснодар", "Краснокамск", "Красноярск", "Кузнецк", "Курган", "Курск", "Лениногорск", "Липецк",
      "Лобня", "Люберцы", "Магадан", "Магнитогорск", "Майкоп", "Махачкала", "Междуреченск", "Михайловск",
      "Мичуринск", "Москва", "Мурманск", "Муром", "Мытищи", "Набережные Челны", "Нальчик", "Находка",
      "Нефтекамск", "Нижневартовск", "Нижнекамск", "Нижний Новгород", "Нижний Тагил", "Новоалтайск", "Новокузнецк",
      "Новороссийск", "Новосибирск", "Новоуральск", "Новочеркасск", "Новый Уренгой", "Норильск", "Обнинск",
      "Одинцово", "Озерск", "Омск", "Орел", "Оренбург", "Орехово-Зуево", "Орск", "Пенза", "Первоуральск",
      "Пермь", "Петрозаводск", "Петропавловск-Камчатский", "Подольск", "Псков", "Пушкино", "Пятигорск",
      "Раменское", "Реутов", "Ржев", "Россошь", "Ростов-на-Дону", "Рыбинск", "Рязань", "Самара",
      "Санкт-Петербург", "Саранск", "Саратов", "Севастополь", "Северодвинск", "Сергиев Посад", "Серпухов", "Симферополь",
      "Смоленск", "Солнечногорск", "Сочи", "Ставрополь", "Старый Оскол", "Стерлитамак", "Сызрань", "Сыктывкар",
      "Таганрог", "Тамбов", "Тверь", "Тобольск", "Тольятти", "Томск", "Туапсе", "Тула", "Тюмень",
      "Улан-Удэ", "Ульяновск", "Уссурийск", "Уфа", "Ухта", "Феодосия", "Хабаровск", "Ханты-Мансийск",
      "Химки", "Чайковский", "Чебоксары", "Челябинск", "Череповец", "Черкесск", "Черногорск", "Чита", "Шадринск",
      "Щекино", "Щелково", "Электросталь", "Элиста", "Энгельс", "Южно-Сахалинск", "Якутск", "Ялта", "Ярославль"
    ];
  }
}
