

export class CompetanceService {
  getAllCompetence(): string[] {
    return [
      "Актерское мастерство", "Английский язык", "Веб-дизайн", "Веб-разработка", "Вокал", "Гидрология", 
      "Гидрохимия", "Графический дизайн", "Дизайн интерьера", "Иглоукалывание", "Импровизация",
      "Йога", "Китайский язык", "Корейский язык", "Лечебное дело", "Машинное обучение", "Мобильные приложения", 
      "Ораторское искусство", "Робототехника", "Французский язык", "Хирургия", "Электрика", "Электроника", 
      "Юмор", "C#", "Go", "HTML+CSS", "Illustrator", "Java", "JavaScript", "NICA",
      "Photoshop", "Python", "Ruby", "TypeScript"
    ];
  }
}
